def calc():
    x = float(input('Введите количество отработанных часов согласно графика работы: '))
    y = float(input('Введите сумму оплаты труда сотрудника за 1 час: '))
    c = float(input('Введите размер ужемесячной премии - '))
    pay = x * y
    return pay + c
print(f'Размер заработной платы за месяц составил: {calc() }')

_______________________________________________2_________________________________________

result_list = []
list = [int(n) for n in input("Введите список чисел: ").split()]
for n in range(1, len(list)):
    if list[n] > list[n-1]:
        (result_list.append(list[n]))
print("Начальный список: ", list)
print("Список, элементы которого больше предыдущего: ", result_list)

_______________________________________________3__________________________________________

my_list = [n for n in range(20, 240) if n % 20 == 0 or n % 21 == 0]

print("Список чисел кратных 20 или 21 в диапазоне [20..240]: ", my_list)

_______________________________________________4__________________________________________

my_list = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
print("Начальные элементы списка:\n", my_list)
new_list = [n for n in my_list if my_list.count(n) == 1]
print("Элементы списка, не имеющие повторений:\n", new_list)

_______________________________________________5__________________________________________

from functools import reduce

list = [n for n in range(100, 1001, 2)]
print("Четные числа в диапазоне [100..1000]:\n", list)
print("Произведение всех элементов списка:\n", reduce(lambda x,y: x*y, list))


